In [463]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
hop = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(hop)

In [595]:
total_players = len(purchase_data["SN"].unique())
total_players

576

In [561]:
# Creating a summary DataFrame using above values
summary_df = pd.DataFrame({"Number of Players":[total_players]})

summary_df

   Number of Players
0                576

In [596]:
total_purchases = purchase_data["Item ID"].count()
total_purchases

780

In [597]:
# Calculate the number of unique authors in the DataFrame
itemname = len(purchase_data["Item Name"].unique())
itemname

179

In [598]:
# The mean method averages the series
average = purchase_data["Price"].mean()
average

3.0509871794871795

In [599]:
# The sum method adds every entry in the series
total = purchase_data["Price"].sum()
total

2379.77

In [469]:
# Creating a summary DataFrame using above values
summary_df = pd.DataFrame({"Number of Unique Items": [itemname],
                           "Average Price": [average],
                           "Total Purchases":[total_purchases],
                           "Total Revenue": [total]})

summary_df

   Number of Unique Items  Average Price  Total Purchases  Total Revenue
0                      11       3.050987              780        2379.77

In [600]:
uni_sn=purchase_data.drop_duplicates(subset=["SN"],keep = "last")
uni_sn

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
467,467,Adairialis76,16,Male,123,Twilight's Carver,2.28,15-19
142,142,Adastirin33,35,Female,175,Woeful Adamantite Claymore,4.48,30-34
388,388,Aeda94,17,Male,128,"Blazeguard, Reach of Eternity",4.91,15-19
28,28,Aela59,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",4.32,20-24
630,630,Aelaria33,23,Male,171,Scalpel,1.79,20-24
...,...,...,...,...,...,...,...,...
548,548,Yathecal82,20,Female,75,Brutality Ivory Warmace,2.42,15-19
93,93,Yathedeu43,22,Male,88,"Emberling, Defender of Delusions",3.75,20-24
572,572,Yoishirrala98,17,Female,145,Fiery Glass Crusader,4.58,15-19
141,141,Zhisrisu83,10,Male,60,Wolf,3.54,<=10
17,17,Zontibe81,21,Male,161,Devine,1.76,20-24

In [471]:
gcount = total_players
gcount

576

In [472]:
malec =  uni_sn["Gender"].value_counts()["Male"]
malec

484

In [473]:
femalec = uni_sn["Gender"].value_counts()["Female"]
femalec

81

In [474]:
otherc = uni_sn["Gender"].value_counts()["Other / Non-Disclosed"]
otherc

11

In [475]:
summary_df = pd.DataFrame({"Total Male": [malec],
                           "Total Female": [femalec],
                           "Total Other/Non-Disclosed":[otherc],
                           "Total Players": [gcount]})

summary_df

   Total Male  Total Female  Total Other/Non-Disclosed  Total Players
0         484            81                         11            576

In [476]:
summary_df2 = pd.DataFrame([{"Player Type": "Male", "Total Count": malec},
                            {"Player Type": "Female", "Total Count": femalec},
                            {"Player Type": "Other/Non-Disclosed", "Total Count":otherc}])

summary_df2

           Player Type  Total Count
0                 Male          484
1               Female           81
2  Other/Non-Disclosed           11

In [477]:
total_players = summary_df2["Total Count"].sum()
total_players

576

In [478]:
# Create a new column that finds the Total Male Percentages
summary_df2["Percentage of Players"] = summary_df2["Total Count"] / total_players
summary_df2

           Player Type  Total Count  Percentage of Players
0                 Male          484               0.840278
1               Female           81               0.140625
2  Other/Non-Disclosed           11               0.019097

In [601]:
# group by Team, get mean, min, and max value of Age for each value of Tea
totals_gender= purchase_data.groupby("Gender").agg({"Price":["sum","mean","max","min"]})
totals_gender

                         Price
                           sum      mean   max   min
Gender
Female                  361.94  3.203009  4.90  1.00
Male                   1967.64  3.017853  4.99  1.00
Other / Non-Disclosed    50.19  3.346000  4.75  1.33

In [480]:
matp=4.99
matp

4.99

In [481]:
fatp=4.90
fatp

4.9

In [482]:
oatp=4.75
oatp

4.75

In [483]:
pur_cm=malec
pur_cm

484

In [484]:
price_summ=1967.64
price_summ

1967.64

In [485]:
avgmp=price_summ/pur_cm
avgmp

4.065371900826446

In [486]:
pur_cf=femalec
pur_cf

81

In [487]:
price_sumf=361.94
price_sumf

361.94

In [488]:
avgfp=price_sumf/pur_cf
avgfp

4.468395061728395

In [489]:
pur_co=otherc
pur_co

11

In [490]:
price_sumo=50.19
price_sumo

50.19

In [491]:
avgop=price_sumo/pur_co
avgop

4.5627272727272725

In [492]:
summarybygender_df = pd.DataFrame([{"Gender": "Male", "Total Count": pur_cm,"Average Purchase Price":avgmp,"Total Purchase Value":price_summ,"Avg Total Purchase Per Person":matp},
                            {"Gender": "Female", "Total Count": pur_cf,"Average Purchase Price":avgfp,"Total Purchase Value":price_sumf,"Avg Total Purchase Per Person":fatp},
                            {"Gender": "Other/Non-Disclosed", "Total Count":pur_co,"Average Purchase Price":avgop,"Total Purchase Value":price_sumo,"Avg Total Purchase Per Person":oatp}])

summarybygender_df

,Gender,Total Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase Per Person
0,Male,484,4.065372,1967.64,4.99
1,Female,81,4.468395,361.94,4.90
2,Other/Non-Disclosed,11,4.562727,50.19,4.75

In [493]:
# Read and display the CSV with Pandas
hop_df = purchase_data
hop_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [494]:
# group by Team, get mean, min, and max value of Age for each value of Tea
totals_gender= hop_df.groupby("Gender").agg({"Age":["mean","max","min"]})
totals_gender

                             Age
                            mean max min
Gender
Female                 21.345133  40   7
Male                   22.917178  45   7
Other / Non-Disclosed  24.200000  38  15

In [495]:
# Figure out the minimum and maximum views for a TED Talk
print(hop_df["Age"].max())
print(hop_df["Age"].min())

45
7

In [496]:
# Create the bins in which Data will be held
# Bins are 0, 59.9, 69.9, 79.9, 89.9, 100.   
bins = [9,10,15,20,24,25,30,35,40]

# Create the names for the five bins
group_labels = ["<10", "10-14", "15-19", "20-24", "25-29","30-34","35-39","40+"]

In [497]:
# Slice the data and place it into bins
pd.cut(hop_df["Age"], bins, labels=group_labels).head()

0    15-19
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): ['<10' < '10-14' < '15-19' < '20-24' < '25-29' < '30-34' < '35-39' < '40+']

In [498]:
# Place the data series into a new column inside of the DataFrame
hop_df["Age Group"] = pd.cut(hop_df["Age"], bins, labels=group_labels)
hop_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [499]:
# Create a GroupBy object based upon "View Group"
age_group = hop_df.groupby("Age Group")

# Find how many rows fall into each bin
c=(age_group["Age"].count())
print(c)

# Find how many rows fall into each bin
p=(age_group["Age"].count()/780)
print(p)

Age Group
<10        9
10-14     54
15-19    200
20-24    266
25-29     59
30-34     77
35-39     52
40+       33
Name: Age, dtype: int64
Age Group
<10      0.011538
10-14    0.069231
15-19    0.256410
20-24    0.341026
25-29    0.075641
30-34    0.098718
35-39    0.066667
40+      0.042308
Name: Age, dtype: float64

In [500]:
agedemo_df = pd.DataFrame({"Total Count":c,"Total Percentages":p*100})

agedemo_df

           Total Count  Total Percentages
Age Group
<10                  9           1.153846
10-14               54           6.923077
15-19              200          25.641026
20-24              266          34.102564
25-29               59           7.564103
30-34               77           9.871795
35-39               52           6.666667
40+                 33           4.230769

In [501]:
# Create a GroupBy object based upon "View Group"
age_group = hop_df.groupby("Age Group")

# Find how many rows fall into each bin
atp=(age_group["Age"].count())
print(atp)

# Get the average of each column within the GroupBy object
psum=age_group[["Price"]].sum()
print(psum)

# Get the average of each column within the GroupBy object
pavg=age_group[["Price"]].mean()
print(pavg)

Age Group
<10        9
10-14     54
15-19    200
20-24    266
25-29     59
30-34     77
35-39     52
40+       33
Name: Age, dtype: int64
            Price
Age Group
<10         31.83
10-14      156.60
15-19      621.56
20-24      799.74
25-29      181.90
30-34      221.42
35-39      155.71
40+        112.35
              Price
Age Group
<10        3.536667
10-14      2.900000
15-19      3.107800
20-24      3.006541
25-29      3.083051
30-34      2.875584
35-39      2.994423
40+        3.404545

In [502]:
# Create the bins in which Data will be held
# Bins are 0, 59.9, 69.9, 79.9, 89.9, 100.   
pbins = [0, 10, 15, 20, 25, 30,35,40,45]

# Create the names for the five bins
group_cat = ["<=10", "11-14", "15-19", "20-24", "25-29","30-34","35-39","40+"]

In [503]:
# Slice the data and place it into bins
pd.cut(hop_df["Age"], pbins, labels=group_cat).head()

0    15-19
1    35-39
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): ['<=10' < '11-14' < '15-19' < '20-24' < '25-29' < '30-34' < '35-39' < '40+']

In [504]:
# Place the data series into a new column inside of the DataFrame
hop_df["Age Group"] = pd.cut(hop_df["Age"], pbins, labels=group_cat)
hop_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [505]:
# Place the data series into a new column inside of the DataFrame
hop_df["Age Group"] = pd.cut(hop_df["Age"], pbins, labels=group_cat)
hop_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [506]:
# Create a GroupBy object based upon "View Group"
age_group = hop_df.groupby("Age Group")

# Find how many rows fall into each bin
a=(age_group["Age"].count())
print(a)

# Find how many rows fall into each bin
admean=(age_group["Price"].mean())
print(admean)

# Find how many rows fall into each bin
d=(age_group["Price"].sum())
print(d)

Age Group
<=10      32
11-14     54
15-19    200
20-24    325
25-29     77
30-34     52
35-39     33
40+        7
Name: Age, dtype: int64
Age Group
<=10     3.405000
11-14    2.900000
15-19    3.107800
20-24    3.020431
25-29    2.875584
30-34    2.994423
35-39    3.404545
40+      3.075714
Name: Price, dtype: float64
Age Group
<=10     108.96
11-14    156.60
15-19    621.56
20-24    981.64
25-29    221.42
30-34    155.71
35-39    112.35
40+       21.53
Name: Price, dtype: float64

In [507]:
agedemo_df = pd.DataFrame({"Total Count":a,"Average Total Price":admean,"Total Purchase Value":d})

agedemo_df

           Total Count  Average Total Price  Total Purchase Value
Age Group
<=10                32             3.405000                108.96
11-14               54             2.900000                156.60
15-19              200             3.107800                621.56
20-24              325             3.020431                981.64
25-29               77             2.875584                221.42
30-34               52             2.994423                155.71
35-39               33             3.404545                112.35
40+                  7             3.075714                 21.53

In [509]:
df = hop_df.sort_values(
    ["SN"])

In [510]:
df["SN"].count()
df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
467,467,Adairialis76,16,Male,123,Twilight's Carver,2.28,15-19
142,142,Adastirin33,35,Female,175,Woeful Adamantite Claymore,4.48,30-34
388,388,Aeda94,17,Male,128,"Blazeguard, Reach of Eternity",4.91,15-19
28,28,Aela59,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",4.32,20-24
630,630,Aelaria33,23,Male,171,Scalpel,1.79,20-24
...,...,...,...,...,...,...,...,...
54,54,Zhisrisu83,10,Male,25,Hero Cane,4.35,<=10
141,141,Zhisrisu83,10,Male,60,Wolf,3.54,<=10
560,560,Zontibe81,21,Male,2,Verdict,2.48,20-24
442,442,Zontibe81,21,Male,84,Arcane Gem,3.79,20-24
17,17,Zontibe81,21,Male,161,Devine,1.76,20-24

In [511]:
df.groupby(['SN']).count()

               Purchase ID  Age  Gender  Item ID  Item Name  Price  Age Group
SN
Adairialis76             1    1       1        1          1      1          1
Adastirin33              1    1       1        1          1      1          1
Aeda94                   1    1       1        1          1      1          1
Aela59                   1    1       1        1          1      1          1
Aelaria33                1    1       1        1          1      1          1
...                    ...  ...     ...      ...        ...    ...        ...
Yathecal82               3    3       3        3          3      3          3
Yathedeu43               2    2       2        2          2      2          2
Yoishirrala98            1    1       1        1          1      1          1
Zhisrisu83               2    2       2        2          2      2          2
Zontibe81                3    3       3        3          3      3          3

[576 rows x 7 columns]

In [512]:
df.groupby(["SN","Price"]).count()

                    Purchase ID  Age  Gender  Item ID  Item Name  Age Group
SN           Price
Adairialis76 2.28             1    1       1        1          1          1
Adastirin33  4.48             1    1       1        1          1          1
Aeda94       4.91             1    1       1        1          1          1
Aela59       4.32             1    1       1        1          1          1
Aelaria33    1.79             1    1       1        1          1          1
...                         ...  ...     ...      ...        ...        ...
Zhisrisu83   3.54             1    1       1        1          1          1
             4.35             1    1       1        1          1          1
Zontibe81    1.76             1    1       1        1          1          1
             2.48             1    1       1        1          1          1
             3.79             1    1       1        1          1          1

[779 rows x 6 columns]

In [603]:
total=df.groupby(['SN'])["Price"].sum()
average = df.groupby(['SN'])["Price"].mean()
count_data =df.groupby(['SN'])["Price"].count()
user_df= pd.DataFrame({"Total Purchase Value":total,"Average":average,"Purchase Count":count_data})
sorted_df=user_df.sort_values("Total Purchase Value",ascending=False)
sorted_df.head()

             Total Purchase Value   Average  Purchase Count
SN
Lisosia93                   18.96  3.792000               5
Idastidru52                 15.45  3.862500               4
Chamjask73                  13.83  4.610000               3
Iral74                      13.62  3.405000               4
Iskadarya95                 13.10  4.366667               3

In [678]:
totalpcnt=df["Price"].sum()
avg=df['Price'].mean()
totalpurvalue=df['Price'].sum()
itemcount=len(df['Item Name'].unique())
popular_df= pd.DataFrame({"Item Count":itemcount,"totp":[totalpcnt],"Average":[avg],"Purchase Value":[totalpurvalue]})
popular_df = popular_df.set_index(['Item Count','totp','Average','Purchase Value'])
popular_df
#sorted_vl=popular_df.sort_values("Item Count",ascending=False)
#sorted_vl.head()

Empty DataFrame
Columns: []
Index: [(179, 2379.77, 3.0509871794871795, 2379.77)]

In [680]:
# It is possible to sort based upon multiple columns
gen_df = popular_df.sort_values(['Item ID'], ["Item Name"], ascending=False)
gen_df.head()

TypeError: unhashable type: 'list'